app/controllers/images_controller.rb

  def index
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def new
    @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

def create
    @attachable_file =Image.new(params[:image])
    @attachable_file.user=@user
    if @attachable_file.save
---
INSERT INTO `images` (`content_type`, `size`, `thumbnail`, `updated_at`, `filename`, `height`, `db_file_id`, `user_id`, `width`, `data`, `created_at`) VALUES('image/jpeg', 51783, NULL, '2010-06-01 10:54:07', '003_Structure_of_a_plant_.jpg', 187, NULL, 1, 250, NULL, '2010-06-01 10:54:07')

def show
  @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 1)

def find_user
 @user=User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)