app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`activation_code` = '24ba6d72d1dc00860ac68d323c884e4fd3d7ea7a') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def find_user
    @user = User.find(params[:id])